idea4good/GuiLiteSamples/HelloWave/BuildSTM32F429-Gcc/guiLite_stm32f429/song/stm32f429i_discovery_ioe.c
    /* If all OK return IOE_OK */
    return IOE_OK;
}


/**
  * @brief  Checks if the IOE device is correctly configured and 
  *         communicates correctly ont the I2C bus.
  * @param  None
  * @retval IOE_OK if IOE is operational. Other value if failure.
  */
uint8_t IOE_IsOperational(void) {
    /* Return Error if the ID is not correct */
    if (IOE_ReadID() != (uint16_t) STMPE811_ID) {
        /* Check if a Timeout occurred */
        if (IOE_TimeOut == 0) {
            return (IOE_TimeoutUserCallback());
        } else {
            return IOE_FAILURE; /* ID is not Correct */
        }
    } else {
        return IOE_OK; /* ID is correct */
    }
}

/**
  * @brief  Resets the IO Expander by Software (SYS_CTRL1, RESET bit).
  * @param  None
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_Reset(void) {
    /* Power Down the IO_Expander */
    I2C_WriteDeviceRegister(IOE_REG_SYS_CTRL1, 0x02);

    /* wait for a delay to insure registers erasing */
    _delay_(2);

    /* Power On the Codec after the power off => all registers are reinitialized*/
    I2C_WriteDeviceRegister(IOE_REG_SYS_CTRL1, 0x00);

    /* If all OK return IOE_OK */
    return IOE_OK;
}

/**
  * @brief  Reads the IOE device ID.
  * @param  None
  * @retval The Device ID (two bytes).
  */
uint16_t IOE_ReadID(void) {
    uint16_t tmp = 0;

    /* Read device ID  */
    tmp = I2C_ReadDeviceRegister(0);
    tmp = (uint32_t) (tmp << 8);
    tmp |= (uint32_t) I2C_ReadDeviceRegister(1);

    /* Return the ID */
    return (uint16_t) tmp;
}

/**
  * @brief  Configures the selected IO Expander functionalities.
  * @param  Fct: the functions to be configured. could be any 
  *         combination of the following values:
  *   @arg  IOE_IO_FCT : IO function
  *   @arg  IOE_TP_FCT : Touch Panel function
  *   @arg  IOE_ADC_FCT : ADC function
  * @param  NewState: can be ENABLE pr DISABLE   
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_FnctCmd(uint8_t Fct, FunctionalState NewState) {
    uint8_t tmp = 0;

    /* Get the register value */
    tmp = I2C_ReadDeviceRegister(IOE_REG_SYS_CTRL2);

    if (NewState != DISABLE) {
        /* Set the Functionalities to be Enabled */
        tmp &= ~(uint8_t) Fct;
    } else {
        /* Set the Functionalities to be Disabled */
        tmp |= (uint8_t) Fct;
    }

    /* Set the register value */
    I2C_WriteDeviceRegister(IOE_REG_SYS_CTRL2, tmp);

    /* If all OK return IOE_OK */
    return IOE_OK;
}


/**
  * @brief  Enables or disables the Global interrupt.
  * @param  NewState: could be ENABLE or DISABLE.        
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_GITCmd(FunctionalState NewState) {
    uint8_t tmp = 0;

    /* Read the Interrupt Control register  */
    tmp = I2C_ReadDeviceRegister(IOE_REG_INT_CTRL);

    if (NewState != DISABLE) {
        /* Set the global interrupts to be Enabled */
        tmp |= (uint8_t) IOE_GIT_EN;
    } else {
        /* Set the global interrupts to be Disabled */
        tmp &= ~(uint8_t) IOE_GIT_EN;
    }

    /* Write Back the Interrupt Control register */
    I2C_WriteDeviceRegister(IOE_REG_INT_CTRL, tmp);

    /* If all OK return IOE_OK */
    return IOE_OK;
}

/**
  * @brief  Configures the selected source to generate or not a global interrupt
  * @param Global_IT: the interrupt source to be configured, could be:
  *   @arg  Global_IT_ADC : ADC interrupt     
  *   @arg  Global_IT_FE : Touch Panel Controller FIFO Error interrupt
  *   @arg  Global_IT_FF : Touch Panel Controller FIFO Full interrupt      
  *   @arg  Global_IT_FOV : Touch Panel Controller FIFO Overrun interrupt     
  *   @arg  Global_IT_FTH : Touch Panel Controller FIFO Threshold interrupt   
  *   @arg  Global_IT_TOUCH : Touch Panel Controller Touch Detected interrupt 
  * @param  NewState: can be ENABLE pr DISABLE   
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_GITConfig(uint8_t Global_IT, FunctionalState NewState) {
    uint8_t tmp = 0;

    /* Get the current value of the INT_EN register */
    tmp = I2C_ReadDeviceRegister(IOE_REG_INT_EN);

    if (NewState != DISABLE) {
        /* Set the interrupts to be Enabled */
        tmp |= (uint8_t) Global_IT;
    } else {
        /* Set the interrupts to be Disabled */
        tmp &= ~(uint8_t) Global_IT;
    }
    /* Set the register */
    I2C_WriteDeviceRegister(IOE_REG_INT_EN, tmp);

    /* If all OK return IOE_OK */
    return IOE_OK;
}

/**
  * @brief  Configures the touch Panel Controller (Single point detection)
  * @param  None
  * @retval IOE_OK if all initializations are OK. Other value if error.
  */
uint8_t IOE_TP_Config(void) {
    /* Enable touch Panel functionality */
    IOE_FnctCmd(IOE_TP_FCT, ENABLE);

    /* Select Sample Time, bit number and ADC Reference */
    I2C_WriteDeviceRegister(IOE_REG_ADC_CTRL1, 0x49);

    /* Wait for ~20 ms */
    _delay_(2);

    /* Select the ADC clock speed: 3.25 MHz */
    I2C_WriteDeviceRegister(IOE_REG_ADC_CTRL2, 0x01);

    /* Select TSC pins in non default mode */
    IOE_IOAFConfig((uint8_t) TOUCH_IO_ALL, DISABLE);

    /* Select 2 nF filter capacitor */
    I2C_WriteDeviceRegister(IOE_REG_TP_CFG, 0x9A);

    /* Select single point reading  */
    I2C_WriteDeviceRegister(IOE_REG_FIFO_TH, 0x01);

    /* Write 0x01 to clear the FIFO memory content. */
    I2C_WriteDeviceRegister(IOE_REG_FIFO_STA, 0x01);

    /* Write 0x00 to put the FIFO back into operation mode  */
    I2C_WriteDeviceRegister(IOE_REG_FIFO_STA, 0x00);

    /* set the data format for Z value: 7 fractional part and 1 whole part */
    I2C_WriteDeviceRegister(IOE_REG_TP_FRACT_XYZ, 0x01);

    /* set the driving capability of the device for TSC pins: 50mA */
    I2C_WriteDeviceRegister(IOE_REG_TP_I_DRIVE, 0x01);

    /* Use no tracking index, touch-panel controller operation mode (XYZ) and
       enable the TSC */
    I2C_WriteDeviceRegister(IOE_REG_TP_CTRL, 0x03);

    /*  Clear all the status pending bits */
    I2C_WriteDeviceRegister(IOE_REG_INT_STA, 0xFF);

    /* Initialize the TS structure to their default values */
    TP_State.TouchDetected = TP_State.X = TP_State.Y = TP_State.Z = 0;

