idea4good/GuiLiteSamples/HelloWave/BuildSTM32F429-Gcc/guiLite_stm32f429/song/stm32f429i_discovery_ioe.c
    /* All configuration done */
    return IOE_OK;
}

/**
  * @brief  Configures the selected pin to be in Alternate function or not.
  * @param  IO_Pin: IO_Pin_x, Where x can be from 0 to 7.   
  * @param  NewState: State of the AF for the selected pin, could be 
  *         ENABLE or DISABLE.       
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_IOAFConfig(uint8_t IO_Pin, FunctionalState NewState) {
    uint8_t tmp = 0;

    /* Get the current state of the GPIO_AF register */
    tmp = I2C_ReadDeviceRegister(IOE_REG_GPIO_AF);

    if (NewState != DISABLE) {
        /* Enable the selected pins alternate function */
        tmp |= (uint8_t) IO_Pin;
    } else {
        /* Disable the selected pins alternate function */
        tmp &= ~(uint8_t) IO_Pin;
    }

    /* Write back the new value in GPIO_AF register */
    I2C_WriteDeviceRegister(IOE_REG_GPIO_AF, tmp);

    /* If all OK return IOE_OK */
    return IOE_OK;
}

/**
  * @brief  Writes a value in a register of the device through I2C.
  * @param  RegisterAddr: The target register address
  * @param  RegisterValue: The target register value to be written 
  * @retval IOE_OK: if all operations are OK. Other value if error.
  */
//uint8_t I2C_DMA_WriteDeviceRegister(uint8_t RegisterAddr, uint8_t RegisterValue)
//{
//  uint32_t read_verif = 0;
//  uint8_t IOE_BufferTX = 0;
//
//  /* Get Value to be written */
//  IOE_BufferTX = RegisterValue;
//
//  /* Configure DMA Peripheral */
//  IOE_DMA_Config(IOE_DMA_TX, (uint8_t*)(&IOE_BufferTX));
//
//  /* Enable the I2C peripheral */
//  I2C_GenerateSTART(IOE_I2C, ENABLE);
//
//  /* Test on SB Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB) == RESET)
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Transmit the slave address and enable writing operation */
//  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);
//
//  /* Test on ADDR Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Transmit the first address for r/w operations */
//  I2C_SendData(IOE_I2C, RegisterAddr);
//
//  /* Test on TXE FLag (data dent) */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while ((!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_TXE)) && (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_BTF)))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Enable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,ENABLE);
//
//  /* Enable DMA TX Channel */
//  DMA_Cmd(IOE_DMA_TX_STREAM, ENABLE);
//
//  /* Wait until DMA Transfer Complete */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!DMA_GetFlagStatus(IOE_DMA_TX_STREAM,IOE_DMA_TX_TCFLAG))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Wait until BTF Flag is set before generating STOP */
//  IOE_TimeOut = 0xFF * TIMEOUT_MAX;
//  while ((!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_BTF)))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send STOP Condition */
//  I2C_GenerateSTOP(IOE_I2C, ENABLE);
//
//  /* Disable DMA TX Channel */
//  DMA_Cmd(IOE_DMA_TX_STREAM, DISABLE);
//
//  /* Disable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,DISABLE);
//
//  /* Clear DMA TX Transfer Complete Flag */
//  DMA_ClearFlag(IOE_DMA_TX_STREAM,IOE_DMA_TX_TCFLAG);
//
//#ifdef VERIFY_WRITTENDATA
//  /* Verify (if needed) that the loaded data is correct  */
//
//  /* Read the just written register*/
//  read_verif = I2C_ReadDeviceRegister(RegisterAddr);
//  /* Load the register and verify its value  */
//  if (read_verif != RegisterValue)
//  {
//    /* Control data wrongly transferred */
//    read_verif = IOE_FAILURE;
//  }
//  else
//  {
//    /* Control data correctly transferred */
//    read_verif = 0;
//  }
//#endif
//
//  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
//  return read_verif;
//}

/**
  * @brief  Reads a register of the device through I2C.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval The value of the read register (0xAA if Timeout occurred)   
  */
//uint8_t I2C_DMA_ReadDeviceRegister(uint8_t RegisterAddr)
//{
//  uint8_t IOE_BufferRX[2] = {0x00, 0x00};
//
//  /* Configure DMA Peripheral */
//  IOE_DMA_Config(IOE_DMA_RX, (uint8_t*)IOE_BufferRX);
//
//  /* Enable DMA NACK automatic generation */
//  I2C_DMALastTransferCmd(IOE_I2C, ENABLE);
//
//  /* Enable the I2C peripheral */
//  I2C_GenerateSTART(IOE_I2C, ENABLE);
//
//  /* Test on SB Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send device address for write */
//  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);
//
//  /* Test on ADDR Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send the device's internal address to write to */
//  I2C_SendData(IOE_I2C, RegisterAddr);
//
//  /* Test on TXE FLag (data dent) */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while ((!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_TXE)) && (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_BTF)))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send START condition a second time */
//  I2C_GenerateSTART(IOE_I2C, ENABLE);
//
//  /* Test on SB Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send IOExpander address for read */
//  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);
//
//  /* Test on ADDR Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Enable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,ENABLE);
//
//  /* Enable DMA RX Channel */
//  DMA_Cmd(IOE_DMA_RX_STREAM, ENABLE);
//
//  /* Wait until DMA Transfer Complete */
//  IOE_TimeOut = 2 * TIMEOUT_MAX;
//  while (!DMA_GetFlagStatus(IOE_DMA_RX_STREAM,IOE_DMA_RX_TCFLAG))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send STOP Condition */
//  I2C_GenerateSTOP(IOE_I2C, ENABLE);
//
//  /* Disable DMA RX Channel */
//  DMA_Cmd(IOE_DMA_RX_STREAM, DISABLE);
//
//  /* Disable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,DISABLE);
//
//  /* Clear DMA RX Transfer Complete Flag */
// DMA_ClearFlag(IOE_DMA_RX_STREAM,IOE_DMA_RX_TCFLAG);
//
//  /* return a pointer to the IOE_Buffer */
//  return (uint8_t)IOE_BufferRX[0];
//}


/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval A pointer to the buffer containing the two returned bytes (in halfword).  
  */
//uint16_t I2C_DMA_ReadDataBuffer(uint32_t RegisterAddr)
//{
//  uint8_t tmp= 0;
//  uint8_t IOE_BufferRX[2] = {0x00, 0x00};
//
//  /* Configure DMA Peripheral */
//  IOE_DMA_Config(IOE_DMA_RX, (uint8_t*)IOE_BufferRX);
//
//  /* Enable DMA NACK automatic generation */
//  I2C_DMALastTransferCmd(IOE_I2C, ENABLE);
//
//  /* Enable the I2C peripheral */
//  I2C_GenerateSTART(IOE_I2C, ENABLE);
//
//  /* Test on SB Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send device address for write */
//  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);
//
//  /* Test on ADDR Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send the device's internal address to write to */
//  I2C_SendData(IOE_I2C, RegisterAddr);
//
//  /* Test on TXE FLag (data dent) */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while ((!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_TXE)) && (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_BTF)))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send START condition a second time */
//  I2C_GenerateSTART(IOE_I2C, ENABLE);
//
//  /* Test on SB Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_GetFlagStatus(IOE_I2C,I2C_FLAG_SB))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send IO Expander address for read */
//  I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);
//
//  /* Test on ADDR Flag */
//  IOE_TimeOut = TIMEOUT_MAX;
//  while (!I2C_CheckEvent(IOE_I2C, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Enable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,ENABLE);
//
//  /* Enable DMA RX Channel */
//  DMA_Cmd(IOE_DMA_RX_STREAM, ENABLE);
//
//  /* Wait until DMA Transfer Complete */
//  IOE_TimeOut = 2 * TIMEOUT_MAX;
//  while (!DMA_GetFlagStatus(IOE_DMA_RX_STREAM, IOE_DMA_RX_TCFLAG))
//  {
//    if (IOE_TimeOut-- == 0) return(IOE_TimeoutUserCallback());
//  }
//
//  /* Send STOP Condition */
//  I2C_GenerateSTOP(IOE_I2C, ENABLE);
//
//  /* Disable DMA RX Channel */
//  DMA_Cmd(IOE_DMA_RX_STREAM, DISABLE);
//
//  /* Disable I2C DMA request */
//  I2C_DMACmd(IOE_I2C,DISABLE);
//
//  /* Clear DMA RX Transfer Complete Flag */
//  DMA_ClearFlag(IOE_DMA_RX_STREAM,IOE_DMA_RX_TCFLAG);
//
//  /* Reorganize received data */
//  tmp = IOE_BufferRX[0];
//  IOE_BufferRX[0] = IOE_BufferRX[1];
//  IOE_BufferRX[1] = tmp;
//
//  /* return the data */
//  return (uint16_t) ((uint16_t)IOE_BufferRX[0] | (uint16_t)IOE_BufferRX[1]<< 8);
//}


/**
  * @brief  Return Touch Panel X position value
  * @param  None
  * @retval X position.
  */
static uint16_t IOE_TP_Read_X(void) {
    int32_t x, xr;

