idea4good/GuiLiteSamples/HelloWave/BuildSTM32F429-Gcc/guiLite_stm32f429/song/stm32f429i_discovery_ioe.c
    /* Read x value from DATA_X register */
    x = I2C_ReadDataBuffer(IOE_REG_TP_DATA_X);

    /* x value first correction */
    if (x <= 3000) {
        x = 3870 - x;
    } else {
        x = 3800 - x;
    }

    /* x value second correction */
    xr = x / 15;

    /* return x position value */
    if (xr <= 0) {
        xr = 0;
    } else if (xr > 240) {
        xr = 239;
    } else {}
    return (uint16_t) (xr);
}

/**
  * @brief  Return Touch Panel Y position value
  * @param  None
  * @retval Y position.
  */
static uint16_t IOE_TP_Read_Y(void) {
    int32_t y, yr;

    /* Read y value from DATA_Y register */
    y = I2C_ReadDataBuffer(IOE_REG_TP_DATA_Y);

    /* y value first correction */

    y -= 360;

    /* y value second correction */
    yr = y / 11;

    /* return y position value */
    if (yr <= 0) {
        yr = 0;
    } else if (yr > 320) {
        yr = 319;
    } else {}
    return (uint16_t) (yr);
}

/**
  * @brief  Return Touch Panel Z position value
  * @param  None
  * @retval Z position.
  */
static uint16_t IOE_TP_Read_Z(void) {
    uint32_t z;

    /* Read z value from DATA_Z register */
    z = I2C_ReadDataBuffer(IOE_REG_TP_DATA_Z);

    /* return z position value */
    if (z <= 0)
        z = 0;
    return (uint16_t) (z);
}

/**
  * @brief  Initializes the GPIO pins used by the IO expander.
  * @param  None
  * @retval None
  */
static void IOE_GPIO_Config(void) {
//  GPIO_InitTypeDef GPIO_InitStructure;
//
//  /* Enable IOE_I2C and IOE_I2C_GPIO_PORT & Alternate Function clocks */
//  RCC_APB1PeriphClockCmd(IOE_I2C_CLK, ENABLE);
//  RCC_AHB1PeriphClockCmd(IOE_I2C_SCL_GPIO_CLK | IOE_I2C_SDA_GPIO_CLK |
//                         IOE_IT_GPIO_CLK, ENABLE);
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
//
//  /* Reset IOE_I2C IP */
//  RCC_APB1PeriphResetCmd(IOE_I2C_CLK, ENABLE);
//  /* Release reset signal of IOE_I2C IP */
//  RCC_APB1PeriphResetCmd(IOE_I2C_CLK, DISABLE);
//
//  /* Connect PXx to I2C_SCL*/
//  GPIO_PinAFConfig(IOE_I2C_SCL_GPIO_PORT, IOE_I2C_SCL_SOURCE, IOE_I2C_SCL_AF);
//  /* Connect PXx to I2C_SDA*/
//  GPIO_PinAFConfig(IOE_I2C_SDA_GPIO_PORT, IOE_I2C_SDA_SOURCE, IOE_I2C_SDA_AF);
//
//  /* IOE_I2C SCL and SDA pins configuration */
//  GPIO_InitStructure.GPIO_Pin = IOE_I2C_SCL_PIN;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
//  GPIO_Init(IOE_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);
//
//  GPIO_InitStructure.GPIO_Pin = IOE_I2C_SDA_PIN;
//  GPIO_Init(IOE_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
    RCC->APB1ENR |= 1 << 23;
    RCC->AHB1ENR |= 1 << 0;
    RCC->AHB1ENR |= 1 << 2;
    RCC->APB2ENR |= 1 << 14;

    RCC->APB1RSTR |= 1 << 23;
    RCC->APB1RSTR &= ~(1 << 23);

    gpio_af_set(GPIOA, 8, 4);
    gpio_af_set(GPIOC, 9, 4);

    gpio_set(GPIOA, PIN8, GPIO_MODE_AF, GPIO_OTYPE_OD, GPIO_SPEED_50M, GPIO_PUPD_NONE);
    gpio_set(GPIOC, PIN9, GPIO_MODE_AF, GPIO_OTYPE_OD, GPIO_SPEED_50M, GPIO_PUPD_NONE);

}

/**
  * @brief  Configure the I2C Peripheral used to communicate with IO_Expanders.
  * @param  None
  * @retval None
  */
static void IOE_I2C_Config(void) {
    I2C_InitTypeDef I2C_InitStructure;

    /* If the I2C peripheral is already enabled, don't reconfigure it */
    if ((IOE_I2C->CR1 & I2C_CR1_PE) == 0) {
        /* IOE_I2C configuration */
        I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
        I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
        I2C_InitStructure.I2C_OwnAddress1 = 0x00;
        I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
        I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
        I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;

        /* Initialize the I2C peripheral */
        I2C_Init(IOE_I2C, &I2C_InitStructure);

        /* Enable the I2C peripheral */
        I2C_Cmd(IOE_I2C, ENABLE);
    }
}

/**
  * @brief  Configure the DMA Peripheral used to handle communication via I2C.
  * @param  None
  * @retval None
  */
//static void IOE_DMA_Config(IOE_DMADirection_TypeDef Direction, uint8_t *buffer) {
//    DMA_InitTypeDef DMA_InitStructure;
//
//    RCC_AHB1PeriphClockCmd(IOE_DMA_CLK, ENABLE);
//
//    /* Initialize the DMA_Channel member */
//    DMA_InitStructure.DMA_Channel = IOE_DMA_CHANNEL;
//
//    /* Initialize the DMA_PeripheralBaseAddr member */
//    DMA_InitStructure.DMA_PeripheralBaseAddr = IOE_I2C_DR;
//
//    /* Initialize the DMA_Memory0BaseAddr member */
//    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) buffer;
//
//    /* Initialize the DMA_PeripheralInc member */
//    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
//
//    /* Initialize the DMA_MemoryInc member */
//    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
//
//    /* Initialize the DMA_PeripheralDataSize member */
//    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
//
//    /* Initialize the DMA_MemoryDataSize member */
//    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
//
//    /* Initialize the DMA_Mode member */
//    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
//
//    /* Initialize the DMA_Priority member */
//    DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
//
//    /* Initialize the DMA_FIFOMode member */
//    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
//
//    /* Initialize the DMA_FIFOThreshold member */
//    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_1QuarterFull;
//
//    /* Initialize the DMA_MemoryBurst member */
//    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
//
//    /* Initialize the DMA_PeripheralBurst member */
//    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
//
//    /* If using DMA for Reception */
//    if (Direction == IOE_DMA_RX) {
//        /* Initialize the DMA_DIR member */
//        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
//
//        /* Initialize the DMA_BufferSize member */
//        DMA_InitStructure.DMA_BufferSize = 2;
//
//        DMA_DeInit(IOE_DMA_RX_STREAM);
//
//        DMA_Init(IOE_DMA_RX_STREAM, &DMA_InitStructure);
//    }
//        /* If using DMA for Transmission */
//    else if (Direction == IOE_DMA_TX) {
//        /* Initialize the DMA_DIR member */
//        DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
//
//        /* Initialize the DMA_BufferSize member */
//        DMA_InitStructure.DMA_BufferSize = 1;
//
//        DMA_DeInit(IOE_DMA_TX_STREAM);
//
//        DMA_Init(IOE_DMA_TX_STREAM, &DMA_InitStructure);
//    }
//}

/**
  * @brief  Writes a value in a register of the device through I2C.
  * @param  RegisterAddr: The target register address
  * @param  RegisterValue: The target register value to be written 
  * @retval IOE_OK: if all operations are OK. Other value if error.
  */
uint8_t I2C_WriteDeviceRegister(uint8_t RegisterAddr, uint8_t RegisterValue) {
    uint32_t read_verif = 0;

    /* Begin the configuration sequence */
    I2C_GenerateSTART(IOE_I2C, ENABLE);

