idea4good/GuiLiteSamples/HelloWave/BuildSTM32F429-Gcc/guiLite_stm32f429/song/stm32f429i_discovery_ioe.c
    /* Test on EV5 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Transmit the slave address and enable writing operation */
    I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

    /* Test on EV6 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Read status register 2 to clear ADDR flag */
    IOE_I2C->SR2;

    /* Test on EV8_1 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Transmit the first address for r/w operations */
    I2C_SendData(IOE_I2C, RegisterAddr);

    /* Test on EV8 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Prepare the register value to be sent */
    I2C_SendData(IOE_I2C, RegisterValue);

    /* Test on EV8_2 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while ((!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF))) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* End the configuration sequence */
    I2C_GenerateSTOP(IOE_I2C, ENABLE);

#ifdef VERIFY_WRITTENDATA
    /* Verify (if needed) that the loaded data is correct  */

    /* Read the just written register*/
    read_verif = IOE_I2C_ReadDeviceRegister(RegisterAddr);

    /* Load the register and verify its value  */
    if (read_verif != RegisterValue)
    {
      /* Control data wrongly transferred */
      read_verif = IOE_FAILURE;
    }
    else
    {
      /* Control data correctly transferred */
      read_verif = 0;
    }
#endif

    /* Return the verifying value: 0 (Passed) or 1 (Failed) */
    return read_verif;

}

/**
  * @brief  Reads a register of the device through I2C without DMA.
  * @param  RegisterAddr: The target register address (between 00x and 0x24)
  * @retval The value of the read register (0xAA if Timeout occurred)   
  */
uint8_t I2C_ReadDeviceRegister(uint8_t RegisterAddr) {
    uint8_t tmp = 0;

    /* Enable the I2C peripheral */
    I2C_GenerateSTART(IOE_I2C, ENABLE);

    /* Test on EV5 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }
    /* Disable Acknowledgement */
    I2C_AcknowledgeConfig(IOE_I2C, DISABLE);

    /* Transmit the slave address and enable writing operation */
    I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

    /* Test on EV6 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Read status register 2 to clear ADDR flag */
    IOE_I2C->SR2;

    /* Test on EV8 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Transmit the first address for r/w operations */
    I2C_SendData(IOE_I2C, RegisterAddr);

    /* Test on EV8 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while ((!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) || (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF))) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Regenerate a start condition */
    I2C_GenerateSTART(IOE_I2C, ENABLE);

    /* Test on EV5 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Transmit the slave address and enable writing operation */
    I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);

    /* Test on EV6 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Read status register 2 to clear ADDR flag */
    IOE_I2C->SR2;

    /* Test on EV7 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_RXNE)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* End the configuration sequence */
    I2C_GenerateSTOP(IOE_I2C, ENABLE);

    /* Load the register value */
    tmp = I2C_ReceiveData(IOE_I2C);

    /* Enable Acknowledgement */
    I2C_AcknowledgeConfig(IOE_I2C, ENABLE);

    /* Return the read value */
    return tmp;

}

/**
  * @brief  Reads a buffer of 2 bytes from the device registers.
  * @param  RegisterAddr: The target register adress (between 00x and 0x24)
  * @retval The data in the buffer containing the two returned bytes (in halfword).   
  */
uint16_t I2C_ReadDataBuffer(uint32_t RegisterAddr) {
    uint8_t IOE_BufferRX[2] = {0x00, 0x00};

    /* Enable the I2C peripheral */
    I2C_GenerateSTART(IOE_I2C, ENABLE);

    /* Test on EV5 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Send device address for write */
    I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Transmitter);

    /* Test on EV6 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Read status register 2 to clear ADDR flag */
    IOE_I2C->SR2;

    /* Test on EV8 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_TXE)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Send the device's internal address to write to */
    I2C_SendData(IOE_I2C, RegisterAddr);

    /* Send START condition a second time */
    I2C_GenerateSTART(IOE_I2C, ENABLE);

