idea4good/GuiLiteSamples/HelloWave/BuildSTM32F429-Gcc/guiLite_stm32f429/song/stm32f429i_discovery_ioe.c
    /* Test on EV5 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_SB)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Send IO Expander address for read */
    I2C_Send7bitAddress(IOE_I2C, IOE_ADDR, I2C_Direction_Receiver);

    /* Test on EV6 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_ADDR)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Disable Acknowledgement and set Pos bit */
    I2C_AcknowledgeConfig(IOE_I2C, DISABLE);
    I2C_NACKPositionConfig(IOE_I2C, I2C_NACKPosition_Next);

    /* Read status register 2 to clear ADDR flag */
    IOE_I2C->SR2;

    /* Test on EV7 and clear it */
    IOE_TimeOut = TIMEOUT_MAX;
    while (!I2C_GetFlagStatus(IOE_I2C, I2C_FLAG_BTF)) {
        if (IOE_TimeOut-- == 0) return (IOE_TimeoutUserCallback());
    }

    /* Send STOP Condition */
    I2C_GenerateSTOP(IOE_I2C, ENABLE);

    /* Read the first byte from the IO Expander */
    IOE_BufferRX[1] = I2C_ReceiveData(IOE_I2C);

    /* Read the second byte from the IO Expander */
    IOE_BufferRX[0] = I2C_ReceiveData(IOE_I2C);

    /* Enable Acknowledgement and reset POS bit to be ready for another reception */
    I2C_AcknowledgeConfig(IOE_I2C, ENABLE);
    I2C_NACKPositionConfig(IOE_I2C, I2C_NACKPosition_Current);

    /* return the data */
    return ((uint16_t) IOE_BufferRX[0] | ((uint16_t) IOE_BufferRX[1] << 8));
}

#ifndef USE_TIMEOUT_USER_CALLBACK

/**
  * @brief  IOE_TIMEOUT_UserCallback
  * @param  None
  * @retval 0
  */
uint8_t IOE_TimeoutUserCallback(void) {
    I2C_InitTypeDef I2C_InitStructure;

    I2C_GenerateSTOP(IOE_I2C, ENABLE);
    I2C_SoftwareResetCmd(IOE_I2C, ENABLE);
    I2C_SoftwareResetCmd(IOE_I2C, DISABLE);

    IOE_GPIO_Config();

    /* CODEC_I2C peripheral configuration */
//    I2C_DeInit(IOE_I2C);
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x00;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;

    /* Enable the I2C peripheral */
    I2C_Cmd(IOE_I2C, ENABLE);
    I2C_Init(IOE_I2C, &I2C_InitStructure);

    return 0;
}

#endif /* !USE_TIMEOUT_USER_CALLBACK */

#ifndef USE_Delay

/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void delay(__IO uint32_t nCount) {
    __IO uint32_t index = 0;
    for (index = (100000 * nCount); index != 0; index--) {
    }
}

#endif /* USE_Delay */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
